Repository: aragornz325/hud_spartan_flutter
Catalog: hud_spartan_flutter/lib/l10n/arb/app_*.arb
Languages: es, it, pt

source: Initializing neural link...
es: Inicializando enlace neural...
it: Inizializzando il collegamento neurale...
pt: Inicializando o link neural...

source: Synchronizing armor interface...
es: Sincronizando interfaz de armadura...
it: Sincronizzando l'interfaccia dell'armatura...
pt: Sincronizando a interface da armadura...

source: Connecting to ONI core...
es: Conectando al núcleo ONI...
it: Collegamento al nucleo ONI...
pt: Conectando ao núcleo ONI...

source: Loading Spartan tactical overlay...
es: Cargando Táctica Spartan...
it: Caricamento dell'overlay tattico Spartan...
pt: Carregando o overlay tático Spartan...

source: ERROR: HUD integrity compromised...
es: ERROR: Integridad del HUD comprometida...
it: ERRORE: integrità del HUD compromessa...
pt: ERRO: integridade do HUD comprometida...

# systemReadyWelcome
source: System ready. Welcome, Spartan-117.
es: Sistema listo. Bienvenido, Spartan-117.
it: Sistema pronto. Benvenuto, Spartan-117.
pt: Sistema pronto. Bem-vindo, Spartan-117.

# thankYouForVisitingMySite
source: Thank you for visiting my app
es: Gracias por visitar mi app
it: Grazie per aver visitato la mia app
pt: Obrigado por visitar meu aplicativo

# youreAboutFullyInteractivePortfolio
source: You're about to enter a fully interactive portfolio
es: Estás a punto de entrar en un portafolio totalmente interactivo
it: Sei sul punto di entrare in un portafoglio completamente interattivo
pt: Você está prestes a entrar em um portfólio totalmente interativo

# designedEmulateSpartanHUDHaloUniverse
source: designed to emulate a Spartan HUD terminal in the Halo universe
es: diseñado para emular una terminal del HUD Spartan en el universo Halo
it: progettato per emulare un terminale HUD Spartan nell'universo di Halo
pt: projetado para emular um terminal HUD Spartan no universo Halo

# engageExploreExecuteCommand
source: Engage, explore, and execute commands as if you had ONI access
es: Interactúa, explorar y ejecutar comandos como si tuvieras acceso ONI
it: Interagisci, esplora ed esegui comandi come se avessi accesso ONI
pt: Interaja, explore e execute comandos como se tivesse acesso ONI

# tapAnywhereInitialize
source: Tap anywhere to initialize...
es: Toque en cualquier lugar para inicializar...
it: Premi ovunque per inizializzare...
pt: Toque em qualquer lugar para inicializar...

# accessingSpartanCombatInterface
source: ACCESSING SPARTAN-RMQ-117 COMBAT INTERFACE...
es: ACCESANDO INTERFAZ DE COMBATE SPARTAN-RMQ-117...
pt: ACESSANDO A INTERFACE DE COMBATE SPARTAN-RMQ-117...

source: LOADING TACTICAL LOADOUT..
es: CARGANDO CARGA TÁCTICA..
it: CARICAMENTO CARICO TATTICO..
pt: CARREGANDO CARREGAMENTO TÁTICO..

source: LOADING WEAPONS LOADOUT..
es: CARGANDO CARGA DE ARMAS..
it: CARICAMENTO CARICO ARMI..
pt: CARREGANDO CARREGAMENTO DE ARMAS..

source: LOADOUT COMPLETE.
es: CARGA COMPLETA.
it: CARICO COMPLETO.
pt: CARREGAMENTO COMPLETO.

source: ACCESSING AVAILABLE COMMANDS...
es: ACCESANDO COMANDOS DISPONIBLES...
it: ACCESO AI COMANDI DISPONIBILI...
pt: ACESSANDO COMANDOS DISPONÍVEIS...

# commandFound
source: COMMANDS FOUND
it: COMANDI TROVATI
pt: COMANDOS ENCONTRADOS

source: ONI COMMANDS NOT SHOWN
es: COMANDOS ONI NO MOSTRADOS
it: COMANDI ONI NON MOSTRATI
pt: COMANDOS ONI NÃO MOSTRADOS

# transmissionClossed
source: TRANSMISSION CLOSED...
es: TRANSMISIÓN CERRADA...
pt: TRANSMISSÃO FECHADA...

source: Command
es: Comando
it: Comando
pt: Comando

source: not recognized.
es: no reconocido.
it: non riconosciuto.
pt: não reconhecido.

# thisWillInitiateHailingSignal
source: ⚠ This will initiate a hailing signal to Spartan-rmq-117. Proceed?
es: ⚠ Esto iniciará una señal de llamada a Spartan-rmq-117. ¿Continuar
it: ⚠ Questo avvierà un segnale di chiamata a Spartan-rmq-117. Continuare?
pt: ⚠ Isso iniciará um sinal de chamada para Spartan-rmq-117. Continuar?

source: Transmitting data...
it: Trasmettendo dati...
pt: Transmitindo dados...

source: Encoding signal...
it: Codifica segnale...
pt: Codificando sinal...

# openingChannelToSpartan
source: Opening channel to Spartan-rmq-117...
es: Abriendo canal a Spartan-rmq-117...
it: Aprendo canale a Spartan-rmq-117...
pt: Abrindo canal para Spartan-rmq-117...

# enterYourSerialID
source: Enter your serial ID (email)
es: Ingresa tu numero de serie (email)
it: Inserisci il tuo numero di serie (email)
pt: Insira seu ID de série (email)

# enterYourBadgeNumber
source: Enter your badge number (opcional - whatsapp)
es: Ingresa tu número de insignia (opcional - whatsapp)
it: Inserisci il tuo numero di badge (opzionale - whatsapp)
pt: Insira seu número de crachá (opcional - whatsapp)

source: Invalid phone number.
es: numero de teléfono inválido.
it: numero di telefono non valido.
pt: número de telefone inválido.

# indicateYourLocation
source: Indicate your location (optional)
es: Indica tu ubicación (opcional)
it: Indica la tua posizione (opzionale)
pt: Indique sua localização (opcional)

source: Message required.
es: Mensaje requerido.
it: Messaggio richiesto.
pt: Mensagem necessária.

# allFieldsCollected
source: All fields collected.Transmit the beacon?
es: Todos los campos han sido recopilados. enviar baliza?
it: Tutti i campi sono stati raccolti. Inviare il segnale?
pt: Todas as informações foram capturadas. Liberar transmissão?

# hailingFrequencyOpenedAndClosed
source: Hailing frequency opened. Awaiting acknowledgement from Spartan-rmq-117 Frequency closed...
es: Frecuencia de llamada abierta. Aguarde confirmación de Spartan-rmq-117. Frecuencia cerrada...
it: Frequenza di chiamata aperta. In attesa di conferma da Spartan-rmq-117.. Frequenza chiusa...
pt: Canal de comunicação aberto. Aguardando resposta de Spartan-rmq-117. Canal encerrado...

# privacyPolicy
source: Política de privacidad
it: Politica sulla privacy
pt: Política de Privacidade

# notGetAnyInfo
source: HUD Spartan is an experimental HUD (Heads-Up Display) interface application designed as part of a personal portfolio. Its purpose is to offer an immersive visual experience inspired by futuristic technology.
es: HUD Spartan es una aplicación experimental de interfaz tipo HUD (Heads-Up Display), diseñada como parte de un portafolio personal. Su propósito es ofrecer una experiencia visual inmersiva inspirada en tecnología futurista.
it: HUD Spartan è un'applicazione sperimentale di interfaccia HUD (Heads-Up Display), progettata come parte di un portfolio personale. Il suo scopo è offrire un'esperienza visiva coinvolgente ispirata alla tecnologia futuristica.
pt: HUD Spartan é um aplicativo experimental de interface HUD (Heads-Up Display), projetado como parte de um portfólio pessoal. Seu objetivo é oferecer uma experiência visual envolvente inspirada na tecnologia futurista.

source: Camera Permission
es: Permiso de Cámara
it: Permesso di fotocamera
pt: Permissão de Câmera

# cameraPermissionDescription
source: The app requests camera access exclusively to capture real-time color information to generate dynamic on-screen visual effects. No images or videos are captured, stored, or transmitted.
es: La aplicación solicita acceso a la cámara exclusivamente para capturar información de color en tiempo real, con el fin de generar efectos visuales dinámicos en pantalla.No se capturan, almacenan ni transmiten imágenes ni videos.
it: L'applicazione richiede l'accesso alla fotocamera esclusivamente per acquisire informazioni sul colore in tempo reale al fine di generare effetti visivi dinamici sullo schermo. Nessuna immagine o video viene catturato, archiviato o trasmesso.
pt: O aplicativo solicita acesso à câmera exclusivamente para capturar informações de cores em tempo real, a fim de gerar efeitos visuais dinâmicos na tela. Nenhuma imagem ou vídeo é capturado, armazenado ou transmitido.

source: User Privacy
es: Privacidad del Usuario
it: Politica sulla privacy dell'utente
pt: Privacidade do Usuário

source: No personal information collected.
es: No se recolecta información personal.
it: Nessuna informazione personale raccolta.
pt: Nenhuma informação pessoal coletada.

# noDataStoredServers
source: No data stored on servers.
es: No se almacenan datos en servidores.
it: Nessun dato memorizzato sui server.
pt: Nenhum dado armazenado em servidores.

# noDataSharedThirdParties
source: No data shared with third parties.
es: No se comparten datos con terceros.
it: Nessun dato condiviso con terze parti.
pt: Nenhum dado é compartilhado com terceiros.

# appRunsCompletelyLocally
source: The app runs completely locally on the user's device.
es: La app funciona de manera completamente local en el dispositivo del usuario.
it: L'app funziona completamente localmente sul dispositivo dell'utente.
pt: O aplicativo é executado completamente localmente no dispositivo do usuário.

# contactDescription
source: For any questions or concerns, you can contact me using the form available in the app or by writing to:
es: Para cualquier duda o consulta, podés contactarme a través del formulario disponible en la aplicación o escribiendo a:
it: Per qualsiasi domanda o dubbio potete contattarmi attraverso il form disponibile nell'applicazione oppure scrivendo a:
pt: Para qualquer dúvida ou questão poderá contactar-me através do formulário disponível na candidatura ou escrevendo para:

# contact
source: Contacto
it: Contatto
